app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT "notes".* FROM "notes"

  def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO "notes" ("comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "boo"], ["user_id", 1], ["created_at", "2019-09-22 01:21:02.343227"], ["updated_at", "2019-09-22 01:21:02.343227"]]

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "comment" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["comment", "haha"], ["updated_at", "2019-09-22 20:11:53.151363"], ["id", 9]]

  def destroy
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 6]]

    def set_note
      @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]